#ifndef _I2C_H
#define _I2C_H

void I2C1_Configuration(void);
// ------------------------------------------------------------------------------------------
// **函数名:I2C_ReadBuffer
// **功能:从I2C读取多个字节
// **参数	chipAddr- 芯片地址, subaddr-子地址( 读取开始地址)
// **		addrmode:子地址类型0--无子地址， 1--8位地址，2--16位地址
// ** 返回0--成功, 1--超时, 2--ACK错误
u8 I2C1_ReadBuffer(u8 chipAddr, u16 subaddr , u8 addrmode, u8* pBuffer, u16 size);
// ------------------------------------------------------------------------------------------

// ------------------------------------------------------------------------------------------
// **函数名:I2C_WriteBuffer
// **功能:向I2C写入多个字节
// **参数	chipAddr- 芯片地址, subaddr-子地址( 读取开始地址)
// **		addrmode:子地址类型0--无子地址， 1--8位地址，2--16位地址
// ** 返回0--成功, 1--超时, 2--ACK错误
u8 I2C1_WriteBuffer(u8 chipAddr, u8 subaddr, u8 addrmode, u8* pBuffer,  u16 size);
// ------------------------------------------------------------------------------------------

#endif
